package ru.astoncourse.task_2;

import org.w3c.dom.ls.LSOutput;

public class Main {
    public static void main(String[] args) {
        PhoneDirectory pd = new PhoneDirectory();
        pd.add("Иванов", "+7-912-345-67-89");
        pd.add("Иванов", "+7-912-345-67-90");
        pd.add("Иванов", "+7-912-345-67-90");
        pd.add("Петров", "+7-923-456-78-91");
        pd.add("Смирнов", "+7-934-567-89-02");
        pd.add("Кузнецов", "+7-945-678-90-13");
        pd.add("Попов", "+7-956-789-01-24");
        pd.add("Иванов", "+7-912-345-67-91");
        pd.add("Васильев", "+7-967-890-12-35");
        pd.add("Лебедев", "+7-978-901-23-46");
        pd.add("Морозов", "+7-989-012-34-57");
        pd.add("Новиков", "+7-900-123-45-68");
        pd.add("Федоров", "+7-911-234-56-79");
        pd.add("Петров", "+7-923-456-78-92");
        pd.add("Кузнецов", "+7-945-678-90-14");
        pd.add("Иванов", "+7-912-345-67-92");
        pd.add("Соколов", "+7-922-345-67-93");

        System.out.println(pd.get("Мазков"));
        System.out.println(pd.get("Иванов"));


    }
}
